In [4]:
sqldf('''
SELECT name, test_1_score FROM scores WHERE test_1_score < 77;
''')

       name  test_1_score
0    Olivia            63
1      Noah            67
2      Emma            72
3    Oliver            63
4    Elijah            67
5  Benjamin            62
6     Lucas            60
7       Mia            64
8     Ethan            68